In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [3]:
%%sql
select * from test.UserActivity;

 * mysql+mysqlconnector://tushar:***@localhost
4 rows affected.

  username activity   startDate     endDate
0    Alice   Travel  2020-02-12  2020-02-20
1    Alice  Dancing  2020-02-21  2020-02-23
2    Alice   Travel  2020-02-24  2020-02-28
3      Bob   Travel  2020-02-11  2020-02-18

In [10]:
%%sql
with activity_info as(
select username, activity, count(1) over(partition by username) total_activities,
rank() over(partition by username order by endDate desc) as rnk
from test.UserActivity)
select username, activity
from activity_info where total_activities = 1
or rnk=2

 * mysql+mysqlconnector://tushar:***@localhost
2 rows affected.

  username activity
0    Alice  Dancing
1      Bob   Travel